tutorials/ancientStuff/incompressible/wDissipationTempBlockageConcentrationResidenceSinkTauSimpleFoam/DoubleGermanCarreau/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    defaultName
    {
        type            solidTraction;
        traction        uniform ( 0 0 0 );
        pressure        uniform 0;
        value           uniform (0 0 0);
    }

    wall
    {
        type            solidTraction;
        traction        uniform ( 0 0 0 );
        pressure        uniform 0;
        value           uniform (0 0 0);
    }
	
    centralInlet
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    leftInlet
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }

    rightInlet
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }	
	outlet
    {
        type            fixedDisplacement;
        value           uniform (0 0 0);
    }
	
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
